public class Main {
    /*
    1. Дана json строка

    {{"фамилия":"Иванов","оценка":"5","предмет":"Математика"},
        {"фамилия":"Петрова","оценка":"4","предмет":"Информатика"},
        {"фамилия":"Краснов","оценка":"5","предмет":"Физика"}}

    Задача написать метод(ы), который распарсит строку и выдаст ответ вида:
    Студент Иванов получил 5 по предмету Математика. Студент Петрова получил 4 по предмету Информатика.
    Студент Краснов получил 5 по предмету Физика.
    Используйте StringBuilder для подготовки ответа
    2. Создать метод, который запишет результат работы в файл Обработайте исключения и запишите ошибки в лог файл
    3.* Получить исходную json строку из файла, используя FileReader или Scanner
    */


    public static void main(String[] args){
        String json = Json.fileToString(Config.INPUTFILE);
        System.out.println(Json.printJson(json));
    }

}
