import java.io.FileNotFoundException;

public class Main {

    public static void main(String[] args) throws FileNotFoundException {
        /*
         * Задана натуральная степень k. Сформировать случайным способом список коэффициентов (от 0 до 100)
         * многочлена многочлен степени k
         * Пример k = 2 => 2*x^2 + 4*x + 5 = 0
         */
//        System.out.println(ExOne.exOne());

        /*
         * Даны 2 файла, в каждом из которых записан многочлен, сформировать файл с суммой многочленов
         */
//        ExTwo.exTwo();

    }
}
