public class ExThree {

    /* 3. Вывести все простые числа от 1 до 1000 (простые числа - это числа которые делятся только на себя
    и на единицу без остатка. Чтобы найти остаток от деления используйте оператор % , например 10%3 будет равно единице)*/

    static String solution(int num) {
        // Результирующая строка
        String result = "";

        // Перебираем все значения
        for (int i = 2; i <= num; i++) {
            // Счётчик
            int count = 0;

            // Проверяем делится ли без остатка
            for (int j = 2; j < i; j++) {
                // Если делится без остатка то увеличиваем счётчик
                if (i % j == 0) {
                    count++;
                }
            }

            // Если счётчик равен 0 то дописываем цифру в результирующую строку
            if (count == 0) {
                result += " " + i;
            }
        }

        return result;
    }
}
